//
//  MixedChartVC.m
//  AAChartKitDemo
//
//  Created by AnAn on 2018/5/12.
//  Copyright © 2018年 Danny boy. All rights reserved.
//

#import "MixedChartVC.h"
#import "AAChartKit.h"


@interface MixedChartVC ()

@property (nonatomic, strong) AAChartModel *aaChartModel;
@property (nonatomic, strong) AAChartView  *aaChartView;

@end

@implementation MixedChartVC

- (void)viewDidLoad {
    [super viewDidLoad];

    self.aaChartView = [[AAChartView alloc]initWithFrame:CGRectMake(0, 0, self.view.frame.size.width, self.view.frame.size.height)];
    self.view.backgroundColor = [UIColor whiteColor];
    self.aaChartView.scrollEnabled = NO;
    self.aaChartView.contentHeight = self.aaChartView.frame.size.height-80;
    [self.view addSubview:self.aaChartView];
    
    
    
    
    NSArray *mixedChartNamesArr = @[@"arearangeMixedLine",
                                    @"columnrangeMixedLine",
                                    @"stackingColumnMixedLine",
                                    @"dashStyleTypeMixed",
                                    @"negativeColorMixed",
                                    @"scatterMixedLine",
                                    @"negativeColorMixedBubble"];
    NSString *chartType = mixedChartNamesArr[self.chartTypeIndex];
    self.aaChartModel = [self configureTheChartModel:chartType];

    [self.aaChartView aa_drawChartWithChartModel:_aaChartModel];

}

- (AAChartModel *)configureTheChartModel:(NSString *)chartType {
    if ([chartType isEqualToString:@"arearangeMixedLine"]) {
        AAChartModel *aaChartModel = AAObject(AAChartModel)
        .titleSet(@"面积范围均线图")
        .subtitleSet(@"混合图的一种")
        .yAxisGridLineWidthSet(@0)
        .xAxisVisibleSet(false)
        .yAxisTitleSet(@"摄氏度")
        .seriesSet(@[@{
                         @"name": @"Range",
                         @"data": @[@[@1246406400000, @14.3, @27.7],
                                    @[@1246492800000, @14.5, @27.8],
                                    @[@1246579200000, @15.5, @29.6],
                                    @[@1246665600000, @16.7, @30.7],
                                    @[@1246752000000, @16.5, @25.0],
                                    @[@1246838400000, @17.8, @25.7],
                                    @[@1246924800000, @13.5, @24.8],
                                    @[@1247011200000, @10.5, @21.4],
                                    @[@1247097600000, @9.2,  @23.8],
                                    @[@1247184000000, @11.6, @21.8],
                                    @[@1247270400000, @10.7, @23.7],
                                    @[@1247356800000, @11.0, @23.3],
                                    @[@1247443200000, @11.6, @23.7],
                                    @[@1247529600000, @11.8, @20.7],
                                    @[@1247616000000, @12.6, @22.4],
                                    @[@1247702400000, @13.6, @19.6],
                                    @[@1247788800000, @11.4, @22.6],
                                    @[@1247875200000, @13.2, @25.0],
                                    @[@1247961600000, @14.2, @21.6],
                                    @[@1248048000000, @13.1, @17.1],
                                    @[@1248134400000, @12.2, @15.5],
                                    @[@1248220800000, @12.0, @20.8],
                                    @[@1248307200000, @12.0, @17.1],
                                    @[@1248393600000, @12.7, @18.3],
                                    @[@1248480000000, @12.4, @19.4],
                                    @[@1248566400000, @12.6, @19.9],
                                    @[@1248652800000, @11.9, @20.2],
                                    @[@1248739200000, @11.0, @19.3],
                                    @[@1248825600000, @10.8, @17.8],
                                    @[@1248912000000, @11.8, @18.5],
                                    @[@1248998400000, @10.8, @16.1]],
                         @"type": AAChartTypeArearange,
                         @"lineWidth": @0,
                         @"linkedTo": @":previous",
                         @"fillOpacity": @0.4,
                         @"zIndex": @0,
                         @"color": @"#1E90FF",
                         @"marker": @{
                                 @"enabled": @false
                                 }
                         },
                     @{
                         @"name": @"Temperature",
                         @"color": @"#1E90FF",
                         @"type": AAChartTypeLine,
                         @"data": @[@[@1246406400000, @21.5],
                                    @[@1246492800000, @22.1],
                                    @[@1246579200000, @23],
                                    @[@1246665600000, @23.8],
                                    @[@1246752000000, @21.4],
                                    @[@1246838400000, @21.3],
                                    @[@1246924800000, @18.3],
                                    @[@1247011200000, @15.4],
                                    @[@1247097600000, @16.4],
                                    @[@1247184000000, @17.7],
                                    @[@1247270400000, @17.5],
                                    @[@1247356800000, @17.6],
                                    @[@1247443200000, @17.7],
                                    @[@1247529600000, @16.8],
                                    @[@1247616000000, @17.7],
                                    @[@1247702400000, @16.3],
                                    @[@1247788800000, @17.8],
                                    @[@1247875200000, @18.1],
                                    @[@1247961600000, @17.2],
                                    @[@1248048000000, @14.4],
                                    @[@1248134400000, @13.7],
                                    @[@1248220800000, @15.7],
                                    @[@1248307200000, @14.6],
                                    @[@1248393600000, @15.3],
                                    @[@1248480000000, @15.3],
                                    @[@1248566400000, @15.8],
                                    @[@1248652800000, @15.2],
                                    @[@1248739200000, @14.8],
                                    @[@1248825600000, @14.4],
                                    @[@1248912000000, @15],
                                    @[@1248998400000, @13.6]],
                         @"zIndex": @1,
                         @"marker": @{
                                 @"fillColor":@"#1E90FF" ,
                                 @"lineWidth": @2,
                                 @"lineColor":@"white"
                                 }
                         },
                     
                     ]);
        return aaChartModel;
    } else if ([chartType isEqualToString:@"columnrangeMixedLine"]) {
        AAChartModel *aaChartModel= AAObject(AAChartModel)
        .titleSet(@"城市气温指数")
        .subtitleSet(@"虚拟数据")
        .yAxisTitleSet(@"摄氏度")
        .markerRadiusSet(@6)
        .yAxisVisibleSet(true)
        .yAxisGridLineWidthSet(@0)
        .symbolStyleSet(AAChartSymbolStyleTypeBorderBlank)
        .chartTypeSet(AAChartTypeLine)
        .categoriesSet(@[@"一月", @"二月", @"三月", @"四月", @"五月", @"六月", @"七月", @"八月", @"九月", @"十月", @"十一月", @"十二月"])
        .dataLabelEnabledSet(true)
        .colorsThemeSet(@[@"#1e90ff",@"#EA007B", @"#49C1B6", @"#FDC20A", @"#F78320", @"#068E81",])
        .seriesSet(@[
                     AAObject(AASeriesElement)
                     .typeSet(AAChartTypeColumnrange)
                     .nameSet(@"温度")
                     .dataSet(@[
                                @[@(-9.7), @9.4],
                                @[@(-8.7), @6.5],
                                @[@(-3.5), @9.4],
                                @[@(-1.4),@19.9],
                                @[@0.0 ,  @22.6],
                                @[@2.9 ,  @29.5],
                                @[@9.2 ,  @30.7],
                                @[@7.3 ,  @26.5],
                                @[@4.4 ,  @18.0],
                                @[@(-3.1),@11.4],
                                @[@(-5.2),@10.4],
                                @[@(-9.9),@16.8]
                                ]),
                     AAObject(AASeriesElement)
                     .typeSet(AAChartTypeLine)
                     .nameSet(@"东京")
                     .dataSet(@[@7.0, @6.9, @9.5, @14.5, @18.2, @21.5, @25.2, @26.5, @23.3, @18.3, @13.9, @9.6]),
                     AAObject(AASeriesElement)
                     .typeSet(AAChartTypeLine)
                     .nameSet(@"纽约")
                     .dataSet(@[@-0.2, @0.8, @5.7, @11.3, @17.0, @22.0, @24.8, @24.1, @20.1, @14.1, @8.6, @2.5]),
                     AAObject(AASeriesElement)
                     .typeSet(AAChartTypeLine)
                     .nameSet(@"柏林")
                     .dataSet(@[@-0.9, @0.6, @3.5, @8.4, @13.5, @17.0, @18.6, @17.9, @14.3, @9.0, @3.9, @1.0]),
                     AAObject(AASeriesElement)
                     .typeSet(AAChartTypeLine)
                     .nameSet(@"伦敦")
                     .dataSet(@[@3.9, @4.2, @5.7, @8.5, @11.9, @15.2, @17.0, @16.6, @14.2, @10.3, @6.6, @4.8]),
                     ]
                   )
        ;
        
        return aaChartModel;
    } else if ([chartType isEqualToString:@"stackingColumnMixedLine"]) {
        AAChartModel *aaChartModel = AAObject(AAChartModel)
        .chartTypeSet(AAChartTypeColumn)
        .titleSet(@"16年1月-16年11月充值客单分析")
        .subtitleSet(@"BY MICVS")
        .stackingSet(AAChartStackingTypeNormal)
        .colorsThemeSet(@[@"rgba(255,144,128,1)",@"rgba(0,191,183,1)", @"rgba(252,230,48,1)",])//主题颜色数组
        .seriesSet(@[
                    AAObject(AASeriesElement)
                    .nameSet(@"新用户")
                    .dataSet(@[@82.89,@67.54,@62.07,@59.43,@67.02,@67.09,@35.66,@71.78,@81.61,@78.85,@79.12,@72.30])
                    .dataLabelsSet((AAObject(AADataLabels)
                                    .enabledSet(YES)
                                    .styleSet(AAObject(AAStyle)
                                              .colorSet(@"#000000")
                                              .fontSizeSet(@"11px")
                                              )
                                    ))
                    ,
                    AAObject(AASeriesElement)
                    .nameSet(@"老用户")
                    .dataSet(@[@198.66,@330.81,@151.95,@160.12,@222.56,@229.05,@128.53,@250.91,@224.47,@473.99,@126.85,@260.50])
                    .dataLabelsSet((AAObject(AADataLabels)
                                    .enabledSet(YES)
                                    .styleSet(AAObject(AAStyle)
                                              .colorSet(@"#000000")
                                              .fontSizeSet(@"11px")
                                              )
                                    ))
                    ,
                    AAObject(AASeriesElement)
                    .typeSet(AAChartTypeLine)
                    .nameSet(@"总量")
                    .dataSet(@[@281.55,@398.35,@214.02,@219.55,@289.57,@296.14,@164.18,@322.69,@306.08,@552.84,@205.97,@332.79])
                    .dataLabelsSet((AAObject(AADataLabels)
                                    .enabledSet(YES)
                                    .styleSet(AAObject(AAStyle)
                                              .colorSet(@"#000000")
                                              .fontSizeSet(@"15px")
                                              .fontWeightSet(AAChartFontWeightTypeBold)
                                              )
                                    ))
                    ,
                   ]);
        return aaChartModel;
    } else if ([chartType isEqualToString:@"dashStyleTypeMixed"]) {
        AAChartModel *aaChartModel = AAObject(AAChartModel)
        .chartTypeSet(AAChartTypeSpline)//图表类型
        .titleSet(@"")//图表主标题
        .subtitleSet(@"")//图表副标题
        .yAxisVisibleSet(true)//设置 Y 轴是否可见
        .colorsThemeSet(@[@"#fe117c",@"#ffc069",@"#06caf4",@"#7dffc0",@"cyan",@"gray"])//设置主体颜色数组
        .yAxisTitleSet(@"")//设置 Y 轴标题
        .tooltipValueSuffixSet(@"℃")//设置浮动提示框单位后缀
        .yAxisGridLineWidthSet(@0)//y轴横向分割线宽度为0(即是隐藏分割线)
        .stackingSet(AAChartStackingTypeNormal)
        //.legendEnabledSet(false)//隐藏图例
        .markerRadiusSet(@0)//隐藏连接点
        .seriesSet(@[
                     AAObject(AASeriesElement)
                     .nameSet(@"SolidSpline")
                     .lineWidthSet(@3)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     AAObject(AASeriesElement)
                     .nameSet(AALineDashSyleTypeDash)
                     .lineWidthSet(@3)
                     .dashStyleSet(AALineDashSyleTypeDash)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     AAObject(AASeriesElement)
                     .nameSet(AALineDashSyleTypeDashDot)
                     .lineWidthSet(@3)
                     .dashStyleSet(AALineDashSyleTypeDashDot)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     AAObject(AASeriesElement)
                     .nameSet(AALineDashSyleTypeLongDash)
                     .lineWidthSet(@3)
                     .dashStyleSet(AALineDashSyleTypeLongDash)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     AAObject(AASeriesElement)
                     .nameSet(AALineDashSyleTypeLongDashDot)
                     .lineWidthSet(@3)
                     .dashStyleSet(AALineDashSyleTypeLongDashDot)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     AAObject(AASeriesElement)
                     .nameSet(AALineDashSyleTypeShortDashDot)
                     .lineWidthSet(@3)
                     .dashStyleSet(AALineDashSyleTypeShortDashDot)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     AAObject(AASeriesElement)
                     .nameSet(AALineDashSyleTypeShortDashDotDot)
                     .lineWidthSet(@3)
                     .dashStyleSet(AALineDashSyleTypeShortDashDotDot)
                     .dataSet(@[@50, @320, @230, @370, @230, @400,]),
                     ]
                   );
        return aaChartModel;
        
    } else if ([chartType isEqualToString:@"negativeColorMixed"]) {
        AAChartModel *aaChartModel = AAObject(AAChartModel)
        .chartTypeSet(AAChartTypeColumn)
        .dataLabelEnabledSet(true)
        .markerRadiusSet(@3)
        .seriesSet(@[
                     AAObject(AASeriesElement)
                     .nameSet(@"Column")
                     .dataSet(@[
                                @-6.4, @-5.2, @-3.0, @0.2, @2.3, @5.5, @8.4, @8.3, @5.1, @0.9, @-1.1, @-4.0,
                                @-6.4, @-5.2, @-3.0, @0.2, @2.3, @5.5, @8.4, @8.3, @5.1, @0.9, @-1.1, @-4.0,
                                @-6.4, @-5.2, @-3.0, @0.2, @2.3, @5.5, @8.4, @8.3, @5.1, @0.9, @-1.1, @-4.0,
                                  ])
                     .colorSet(@"#0088ff")
                     .negativeColorSet(@"#FF0000")
                     .thresholdSet(@4)//default:0
                     ,
                     ]);
        return aaChartModel;
    } else if ([chartType isEqualToString:@"scatterMixedLine"]) {
        AAChartModel *aaChartModel = AAObject(AAChartModel)
        .chartTypeSet(AAChartTypeScatter)
        .seriesSet(@[AAObject(AASeriesElement)
                     .nameSet(@"Scatter")
                     .dataSet(@[
                                @[@0.067732, @3.176513],
                                @[@0.42781,  @3.816464],
                                @[@0.995731, @4.550095],
                                @[@0.738336, @4.256571],
                                @[@0.981083, @4.560815],
                                @[@0.526171, @3.929515],
                                @[@0.378887,  @3.52617],
                                @[@0.033859, @3.156393],
                                @[@0.132791, @3.110301],
                                @[@0.138306, @3.149813],
                                @[@0.247809, @3.476346],
                                @[@0.64827,  @4.119688],
                                @[@0.731209, @4.282233],
                                @[@0.236833, @3.486582],
                                @[@0.969788, @4.655492],
                                @[@0.607492, @3.965162],
                                @[@0.358622,   @3.5149],
                                @[@0.147846, @3.125947],
                                @[@0.63782,  @4.094115],
                                @[@0.230372, @3.476039],
                                @[@0.070237,  @3.21061],
                                @[@0.067154, @3.190612],
                                @[@0.925577, @4.631504],
                                @[@0.717733,  @4.29589],
                                @[@0.015371, @3.085028],
                                @[@0.33507,   @3.44808],
                                @[@0.040486,  @3.16744],
                                @[@0.212575, @3.364266],
                                @[@0.617218, @3.993482],
                                @[@0.541196, @3.891471],
                                @[@0.045353, @3.143259],
                                @[@0.126762, @3.114204],
                                @[@0.556486, @3.851484],
                                @[@0.901144, @4.621899],
                                @[@0.958476, @4.580768],
                                @[@0.274561, @3.620992],
                                @[@0.394396, @3.580501],
                                @[@0.87248,  @4.618706],
                                @[@0.409932, @3.676867],
                                @[@0.908969, @4.641845],
                                @[@0.166819, @3.175939],
                                @[@0.665016,  @4.26498],
                                @[@0.263727, @3.558448],
                                @[@0.231214, @3.436632],
                                @[@0.552928, @3.831052],
                                @[@0.047744, @3.182853],
                                @[@0.365746, @3.498906],
                                @[@0.495002, @3.946833],
                                @[@0.493466, @3.900583],
                                @[@0.792101, @4.238522],
                                @[@0.76966,   @4.23308],
                                @[@0.251821, @3.521557],
                                @[@0.181951, @3.203344],
                                @[@0.808177, @4.278105],
                                @[@0.334116, @3.555705],
                                @[@0.33863,  @3.502661],
                                @[@0.452584, @3.859776],
                                @[@0.69477,  @4.275956],
                                @[@0.590902, @3.916191],
                                @[@0.307928, @3.587961],
                                @[@0.148364, @3.183004],
                                @[@0.70218,  @4.225236],
                                @[@0.721544, @4.231083],
                                @[@0.666886, @4.240544],
                                @[@0.124931, @3.222372],
                                @[@0.618286, @4.021445],
                                @[@0.381086, @3.567479],
                                @[@0.385643,  @3.56258],
                                @[@0.777175, @4.262059],
                                @[@0.116089, @3.208813],
                                @[@0.115487, @3.169825],
                                @[@0.66351,  @4.193949],
                                @[@0.254884, @3.491678],
                                @[@0.993888, @4.533306],
                                @[@0.295434, @3.550108],
                                @[@0.952523, @4.636427],
                                @[@0.307047, @3.557078],
                                @[@0.277261, @3.552874],
                                @[@0.279101, @3.494159],
                                @[@0.175724, @3.206828],
                                @[@0.156383, @3.195266],
                                @[@0.733165, @4.221292],
                                @[@0.848142, @4.413372],
                                @[@0.771184, @4.184347],
                                @[@0.429492, @3.742878],
                                @[@0.162176, @3.201878],
                                @[@0.917064, @4.648964],
                                @[@0.315044, @3.510117],
                                @[@0.201473, @3.274434],
                                @[@0.297038, @3.579622],
                                @[@0.336647, @3.489244],
                                @[@0.666109, @4.237386],
                                @[@0.583888, @3.913749],
                                @[@0.085031,  @3.22899],
                                @[@0.687006, @4.286286],
                                @[@0.949655, @4.628614],
                                @[@0.189912, @3.239536],
                                @[@0.844027, @4.457997],
                                @[@0.333288, @3.513384],
                                @[@0.427035, @3.729674],
                                @[@0.466369, @3.834274],
                                @[@0.550659, @3.811155],
                                @[@0.278213, @3.598316],
                                @[@0.918769, @4.692514],
                                @[@0.886555, @4.604859],
                                @[@0.569488, @3.864912],
                                @[@0.066379, @3.184236],
                                @[@0.335751, @3.500796],
                                @[@0.426863, @3.743365],
                                @[@0.395746, @3.622905],
                                @[@0.694221, @4.310796],
                                @[@0.27276,  @3.583357],
                                @[@0.503495, @3.901852],
                                @[@0.067119, @3.233521],
                                @[@0.038326, @3.105266],
                                @[@0.599122, @3.865544],
                                @[@0.947054, @4.628625],
                                @[@0.671279, @4.231213],
                                @[@0.434811, @3.791149],
                                @[@0.509381, @3.968271],
                                @[@0.749442,  @4.25391],
                                @[@0.058014,  @3.19471],
                                @[@0.482978, @3.996503],
                                @[@0.466776, @3.904358],
                                @[@0.357767, @3.503976],
                                @[@0.949123, @4.557545],
                                @[@0.41732,  @3.699876],
                                @[@0.920461, @4.613614],
                                @[@0.156433, @3.140401],
                                @[@0.656662, @4.206717],
                                @[@0.616418, @3.969524],
                                @[@0.853428, @4.476096],
                                @[@0.133295, @3.136528],
                                @[@0.693007, @4.279071],
                                @[@0.178449, @3.200603],
                                @[@0.199526, @3.299012],
                                @[@0.073224, @3.209873],
                                @[@0.286515, @3.632942],
                                @[@0.182026, @3.248361],
                                @[@0.621523, @3.995783],
                                @[@0.344584, @3.563262],
                                @[@0.398556, @3.649712],
                                @[@0.480369, @3.951845],
                                @[@0.15335,  @3.145031],
                                @[@0.171846, @3.181577],
                                @[@0.867082, @4.637087],
                                @[@0.223855, @3.404964],
                                @[@0.528301, @3.873188],
                                @[@0.890192, @4.633648],
                                @[@0.106352, @3.154768],
                                @[@0.917886, @4.623637],
                                @[@0.014855, @3.078132],
                                @[@0.567682, @3.913596],
                                @[@0.068854, @3.221817],
                                @[@0.603535, @3.938071],
                                @[@0.53205,  @3.880822],
                                @[@0.651362, @4.176436],
                                @[@0.901225, @4.648161],
                                @[@0.204337, @3.332312],
                                @[@0.696081, @4.240614],
                                @[@0.963924, @4.532224],
                                @[@0.98139,  @4.557105],
                                @[@0.987911, @4.610072],
                                @[@0.990947, @4.636569],
                                @[@0.736021, @4.229813],
                                @[@0.253574,  @3.50086],
                                @[@0.674722, @4.245514],
                                @[@0.939368, @4.605182],
                                @[@0.235419,  @3.45434],
                                @[@0.110521, @3.180775],
                                @[@0.218023,  @3.38082],
                                @[@0.869778,  @4.56502],
                                @[@0.19683,  @3.279973],
                                @[@0.958178, @4.554241],
                                @[@0.972673,  @4.63352],
                                @[@0.745797, @4.281037],
                                @[@0.445674, @3.844426],
                                @[@0.470557, @3.891601],
                                @[@0.549236, @3.849728],
                                @[@0.335691, @3.492215],
                                @[@0.884739, @4.592374],
                                @[@0.918916, @4.632025],
                                @[@0.441815,  @3.75675],
                                @[@0.116598, @3.133555],
                                @[@0.359274, @3.567919],
                                @[@0.814811, @4.363382],
                                @[@0.387125, @3.560165],
                                @[@0.982243, @4.564305],
                                @[@0.78088,  @4.215055],
                                @[@0.652565, @4.174999],
                                @[@0.87003,   @4.58664],
                                @[@0.604755, @3.960008],
                                @[@0.255212, @3.529963],
                                @[@0.730546, @4.213412],
                                @[@0.493829, @3.908685],
                                @[@0.257017, @3.585821],
                                @[@0.833735, @4.374394],
                                @[@0.070095, @3.213817],
                                @[@0.52707,  @3.952681],
                                @[@0.116163, @3.129283]
                                ])
                     ]);
        return aaChartModel;
    } else if ([chartType isEqualToString:@"negativeColorMixedBubble"]) {
        AAChartModel *aaChartModel = AAObject(AAChartModel)
        .chartTypeSet(AAChartTypeBubble)
        .dataLabelEnabledSet(true)
        .markerRadiusSet(@3)
        .seriesSet(@[
                     AAObject(AASeriesElement)
                     .nameSet(@"Bubble")
                     .dataSet(@[@[@0,@0,@5],@[@0,@1,@1],@[@0,@2,@0],@[@0,@3,@0],@[@0,@4,@0],@[@0,@5,@0],@[@0,@6,@0],@[@0,@7,@0],@[@0,@8,@0],@[@0,@9,@0],@[@0,@10,@0],@[@0,@11,@2],@[@0,@12,@4],@[@0,@13,@1],@[@0,@14,@1],@[@0,@15,@3],@[@0,@16,@4],@[@0,@17,@6],@[@0,@18,@4],@[@0,@19,@4],@[@0,@20,@3],@[@0,@21,@3],@[@0,@22,@2],@[@0,@23,@5],@[@1,@0,@7],@[@1,@1,@0],@[@1,@2,@0],@[@1,@3,@0],@[@1,@4,@0],@[@1,@5,@0],@[@1,@6,@0],@[@1,@7,@0],@[@1,@8,@0],@[@1,@9,@0],@[@1,@10,@5],@[@1,@11,@2],@[@1,@12,@2],@[@1,@13,@6],@[@1,@14,@9],@[@1,@15,@11],@[@1,@16,@6],@[@1,@17,@7],@[@1,@18,@8],@[@1,@19,@12],@[@1,@20,@5],@[@1,@21,@5],@[@1,@22,@7],@[@1,@23,@2],@[@2,@0,@1],@[@2,@1,@1],@[@2,@2,@0],@[@2,@3,@0],@[@2,@4,@0],@[@2,@5,@0],@[@2,@6,@0],@[@2,@7,@0],@[@2,@8,@0],@[@2,@9,@0],@[@2,@10,@3],@[@2,@11,@2],@[@2,@12,@1],@[@2,@13,@9],@[@2,@14,@8],@[@2,@15,@10],@[@2,@16,@6],@[@2,@17,@5],@[@2,@18,@5],@[@2,@19,@5],@[@2,@20,@7],@[@2,@21,@4],@[@2,@22,@2],@[@2,@23,@4],@[@3,@0,@7],@[@3,@1,@3],@[@3,@2,@0],@[@3,@3,@0],@[@3,@4,@0],@[@3,@5,@0],@[@3,@6,@0],@[@3,@7,@0],@[@3,@8,@1],@[@3,@9,@0],@[@3,@10,@5],@[@3,@11,@4],@[@3,@12,@7],@[@3,@13,@14],@[@3,@14,@13],@[@3,@15,@12],@[@3,@16,@9],@[@3,@17,@5],@[@3,@18,@5],@[@3,@19,@10],@[@3,@20,@6],@[@3,@21,@4],@[@3,@22,@4],@[@3,@23,@1],@[@4,@0,@1],@[@4,@1,@3],@[@4,@2,@0],@[@4,@3,@0],@[@4,@4,@0],@[@4,@5,@1],@[@4,@6,@0],@[@4,@7,@0],@[@4,@8,@0],@[@4,@9,@2],@[@4,@10,@4],@[@4,@11,@4],@[@4,@12,@2],@[@4,@13,@4],@[@4,@14,@4],@[@4,@15,@14],@[@4,@16,@12],@[@4,@17,@1],@[@4,@18,@8],@[@4,@19,@5],@[@4,@20,@3],@[@4,@21,@7],@[@4,@22,@3],@[@4,@23,@0],@[@5,@0,@2],@[@5,@1,@1],@[@5,@2,@0],@[@5,@3,@3],@[@5,@4,@0],@[@5,@5,@0],@[@5,@6,@0],@[@5,@7,@0],@[@5,@8,@2],@[@5,@9,@0],@[@5,@10,@4],@[@5,@11,@1],@[@5,@12,@5],@[@5,@13,@10],@[@5,@14,@5],@[@5,@15,@7],@[@5,@16,@11],@[@5,@17,@6],@[@5,@18,@0],@[@5,@19,@5],@[@5,@20,@3],@[@5,@21,@4],@[@5,@22,@2],@[@5,@23,@0],@[@6,@0,@1],@[@6,@1,@0],@[@6,@2,@0],@[@6,@3,@0],@[@6,@4,@0],@[@6,@5,@0],@[@6,@6,@0],@[@6,@7,@0],@[@6,@8,@0],@[@6,@9,@0],@[@6,@10,@1],@[@6,@11,@0],@[@6,@12,@2],@[@6,@13,@1],@[@6,@14,@3],@[@6,@15,@4],@[@6,@16,@0],@[@6,@17,@0],@[@6,@18,@0],@[@6,@19,@0],@[@6,@20,@1],@[@6,@21,@2],@[@6,@22,@2],@[@6,@23,@6]])
                     .colorSet(@"#0088ff")
                     .negativeColorSet(@"#FF0000")
                     .thresholdSet(@5)//default:0
                     ,
                     ]);
        return aaChartModel;
    }
    return nil;
}


@end
